{"title":{"0":"","1":"","2":"","3":"Texans did not immediately receive flood alerts after request, audio reveals","4":"'I created it myself': The boy behind the viral 'aura farming' boat racing dance","5":"Starmer and Macron plead for patience in an impatient world","6":"Row over language turns violent in India's richest state","7":"Chinese students sleep off heatwave in libraries and tents","8":"","9":"","10":"Is there a secret formula for election-winning slogans?","11":"India and China strive to reset ties but with caution","12":"'I created it myself': The boy behind the viral 'aura farming' boat racing dance","13":"Watch: BBC on the ground in Texas as cadaver dogs search for missing flood victims","14":"","15":"","16":"Nigeria has 'enough problems' and can't take deportees from US, minister says","17":"Justin Bieber stands on business with surprise new album","18":"Judge blocks Trump's birthright order after Supreme Court ruling","19":"","20":"Fitness concerns remain before Djokovic-Sinner semi","21":"Bilbao's Alvarez fails drugs test for alopecia medicine"},"description":{"0":"","1":"","2":"","3":"A firefighter appears to have called for emergency alerts at least an hour before the first warnings were received.","4":"Over the past few weeks, a boy dancing on the prow of a racing boat has become an internet sensation.","5":"The UK and France have agreed a \"one in, one out\" deal for migrants crossing the Channel.","6":"The Maharashtra government has backtracked on a move to make Hindi mandatory in schools, but tensions continue.","7":"As eastern China deals with extreme heat, residents are finding new ways to cool down.","8":"","9":"","10":"Political strategist Chris Bruni-Lowe claims in a new book that eight words hold the key to electoral success.","11":"Bilateral relations between India and China have improved since the 2020 clash - but larger challenges remain.","12":"Over the past few weeks, a boy dancing on the prow of a racing boat has become an internet sensation.","13":"Carl Nasman reports alongside a search team on the Guadalupe River, as more than 150 remain missing nearly a week after deadly flooding.","14":"","15":"","16":"Nigeria cannot accept Venezuelans because \"we already have over 230 million people,\" says the foreign minister.","17":"Canadian singer Justin Bieber has surprised fans by releasing his first new album in four years.","18":"The White House vowed to fight the judge's ruling, which once again paused a priority for Trump.","19":"","20":"Concerns remain over Novak Djokovic's fitness after he cancels a scheduled practice session before his Wimbledon semi-final against Jannik Sinner.","21":"Athletic Bilbao defender Yeray Alvarez is provisionally suspended for \"unintentional\" use of banned substance used to treat alopecia."},"date":{"0":"","1":"","2":"","3":"1 hr ago","4":"3 hrs ago","5":"6 hrs ago","6":"11 hrs ago","7":"2 days ago","8":"","9":"","10":"11 hrs ago","11":"1 day ago","12":"3 hrs ago","13":"12 hrs ago","14":"","15":"","16":"15 mins ago","17":"5 hrs ago","18":"9 hrs ago","19":"","20":"5 hrs ago","21":"47 mins ago"},"category":{"0":"","1":"","2":"","3":"US & Canada","4":"Asia","5":"Politics","6":"Asia","7":"Asia","8":"","9":"","10":"Politics","11":"World","12":"Asia","13":"US & Canada","14":"","15":"","16":"World","17":"Culture","18":"US & Canada","19":"","20":"Tennis","21":"European Football"}}